XUANTIE-RV/open-yoc/components/drv_wifi_bl606p/bl606p_devops.c
/*
 * Copyright (C) 2019-2020 Alibaba Group Holding Limited
 */

#include <stdio.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>
#include <aos/aos.h>
#include <aos/debug.h>
#include <uservice/uservice.h>
#include <devices/netdrv.h>

#include <lwip/apps/dhcps.h>
#include <lwip/netifapi.h>
#include <lwip/dns.h>

#include <netif/ethernet.h>
#include <devices/wifi.h>
#include <devices/hal/wifi_impl.h>
#include "wifi_mgmr_ext.h"
#include <ulog/ulog.h>
#include <aos/yloop.h>
#include <bl606p_yloop.h>

#include <bl60x_fw_api.h>
#include <bl_efuse.h>

#ifdef CONFIG_KV_SMART
#include <aos/kv.h>
#endif
#define WIFI_STACK_SIZE  (1536)
#define TASK_PRIORITY_FW (1)
#include "k_api.h"

#define TAG "wifi"

#if !defined(MIN)
#define MIN(a, b) ((a) < (b) ? (a) : (b))
#endif

#define IEEE80211_FTYPE_MGMT 0x0000
#define IEEE80211_FTYPE_CTL  0x0004
#define IEEE80211_FTYPE_DATA 0x0008

#define WIFI_AP_DATA_RATE_1Mbps   0x00
#define WIFI_AP_DATA_RATE_2Mbps   0x01
#define WIFI_AP_DATA_RATE_5_5Mbps 0x02
#define WIFI_AP_DATA_RATE_11Mbps  0x03
#define WIFI_AP_DATA_RATE_6Mbps   0x0b
#define WIFI_AP_DATA_RATE_9Mbps   0x0f
#define WIFI_AP_DATA_RATE_12Mbps  0x0a
#define WIFI_AP_DATA_RATE_18Mbps  0x0e
#define WIFI_AP_DATA_RATE_24Mbps  0x09
#define WIFI_AP_DATA_RATE_36Mbps  0x0d
#define WIFI_AP_DATA_RATE_48Mbps  0x08
#define WIFI_AP_DATA_RATE_54Mbps  0x0c

typedef struct {
    aos_dev_t device;
    uint8_t   mode;
    void (*write_event)(aos_dev_t *dev, int event_id, void *priv);
    void *priv;
} wifi_dev_t;

typedef struct ieee80211_frame_info {
    unsigned short i_fc;
    unsigned short i_dur;
    unsigned char  i_addr1[6];
    unsigned char  i_addr2[6];
    unsigned char  i_addr3[6];
    unsigned short i_seq;
    unsigned char  bssid[6];
    unsigned char  encrypt;
    signed char    rssi;
} ieee80211_frame_info_t;

struct wifi_ap_data_rate {
    uint8_t     data_rate;
    const char *val;
};

static const struct wifi_ap_data_rate data_rate_list[] = {
    { WIFI_AP_DATA_RATE_1Mbps, "1.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_2Mbps, "2.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_5_5Mbps, "5.5 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_11Mbps, "11.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_6Mbps, "6.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_9Mbps, "9.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_12Mbps, "12.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_18Mbps, "18.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_24Mbps, "24.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_36Mbps, "36.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_48Mbps, "48.0 Mbit/s, 20Mhz" },
    { WIFI_AP_DATA_RATE_54Mbps, "54.0 Mbit/s, 20Mhz" },
};

static void wifi_sta_stop(void);
static void wifi_ap_stop(void);
// advise: hal functions using global variable here may be deleted
static wifi_lpm_mode_t       g_wifi_lpm_mode;
static wifi_config_t         g_config;
static int                   sta_task_state;
static int                   wifi_crashed;
static wifi_interface_t      sta_wifi_interface;
static wifi_interface_t      ap_wifi_interface;
static wifi_mgmr_ap_item_t  *ap_ary_p;
static uint32_t              scan_cnt;
static wifi_promiscuous_cb_t sinnfer_fn;
static uint8_t               mgmt_is_enable;
static wifi_event_func      *g_evt_func;
static wifi_mgnt_cb_t        mgmt_fn;
static aos_dev_t            *wifi_evt_dev;

__attribute__((section(".wifi_ram"))) static cpu_stack_t wifi_stack[WIFI_STACK_SIZE];

static ktask_t wifi_fw_task;

#define DRIVER_INVALID_RETURN_VAL                             \
    do {                                                      \
        if (wifi_crashed)                                     \
            return -1;                                        \
    } while (0)

#define DRIVER_INVALID_RETURN                                 \
    do {                                                      \
        if (wifi_crashed)                                     \
            return;                                           \
    } while (0)

#define PTA_REG_BASE_ADDR               (0x24920000)
#define PTA_REG_REVISION                (*(volatile uint32_t *)(PTA_REG_BASE_ADDR + 0x00))
#define PTA_REG_CONFIG                  (*(volatile uint32_t *)(PTA_REG_BASE_ADDR + 0x04))
uint32_t btc = 0;
uint32_t wific = 0;
uint8_t c = 0;
float btc_wifi = 0.0;

static void cal_pta(void)                                                                                                                                                                                                                               
{
    uint32_t config = PTA_REG_CONFIG;
    if ((config & 0x000c0000) && (!(config & 0x00030000))) {
        btc ++;
    } else if ((config & 0x00030000) && (!(config & 0x000c0000))) {
        wific ++;
    }
    if (0 == (c%100)) {
        btc_wifi = (float)btc/(btc+wific);
        LOGD(TAG, "[%lld] cal_pta %lx, %lx, %.3f\r\n", aos_now_ms(), btc, wific, (float)btc/(btc+wific));
        //int bl_wifi_ps_dump(void);
        //bl_wifi_ps_dump();
        btc = 0;
        wific = 0;
        c = 0;
    }
    c ++;
}

static BL_Timer_t timer = NULL;

static void _wifi_ps_mode(void *arg)                                                                                                                                                                                                                    
{
    int mode = (int)arg;
    if (mode) {

        if (timer == NULL) {
            timer = bl_os_timer_create(cal_pta, NULL);
            bl_os_timer_start_periodic(timer, 0, 10 *1e6);
        }

        wifi_mgmr_sta_ps_enter(WIFI_COEX_PM_STA_MESH);
        wifi_mgmr_set_wifi_active_time(50);
    } else {
         if (timer) {
            bl_os_timer_delete(timer, 0);
            timer = NULL;
         }
        wifi_mgmr_sta_ps_exit();
    }
}

bool tg_wifi_connected(void)
{
    int state;
    bool connected = false;
    
    wifi_mgmr_state_get(&state);
    if (WIFI_STATE_CONNECTED_IP_GOT == state || 
        WIFI_STATE_CONNECTED_IP_GETTING ==state) {
        connected = true;
    } 
    return connected;
}

int tg_wifi_ps_mode_entry(void)
{
    if (tg_wifi_connected()) {
        aos_post_delayed_action(1000, _wifi_ps_mode, (void *)1);
    }
    return 0;
}

int tg_wifi_ps_mode_exit(void)
{   
    aos_post_delayed_action(1000, _wifi_ps_mode, (void *)0);
    return 0;
}

static int bl606p_set_mac_addr(aos_dev_t *dev, const uint8_t *mac)
{
    /** write this mac address will write to efuse, forbidden this */
    return -1;
}

static int bl606p_get_mac_addr(aos_dev_t *dev, uint8_t *mac)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    int ret = wifi_mgmr_sta_mac_get((uint8_t *)mac);
    return ret;
}

static int bl606p_set_dns_server(aos_dev_t *dev, ip_addr_t ipaddr[], uint32_t num)
{
    return -1;
}

