XUANTIE-RV/open-yoc/components/drv_wifi_bl606p/bl606p_devops.c
static int bl606p_get_dns_server(aos_dev_t *dev, ip_addr_t ipaddr[], uint32_t num)
{
    int n = MIN(num, 2);

    if (n == 2) {
        wifi_mgmr_sta_dns_get(&ipaddr[0].addr, &ipaddr[1].addr);
    } else {
        wifi_mgmr_sta_dns_get(&ipaddr[0].addr, NULL);
    }
    return n;
}

static int bl606p_set_hostname(aos_dev_t *dev, const char *name)
{

    return -1;
}

static const char *bl606p_get_hostname(aos_dev_t *dev)
{
    return NULL;
}

static int bl606p_start_dhcp(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_stop_dhcp(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_set_ipaddr(aos_dev_t *dev, const ip_addr_t *ipaddr, const ip_addr_t *netmask, const ip_addr_t *gw)
{
    return -1;
}

static int bl606p_get_ipaddr(aos_dev_t *dev, ip_addr_t *ipaddr, ip_addr_t *netmask, ip_addr_t *gw)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    uint32_t ip, mask, gateway;

    if (sta_wifi_interface)
        wifi_mgmr_sta_ip_get(&ip, &mask, &gateway);
    else
        wifi_mgmr_ap_ip_get(&ip, &mask, &gateway);

    if (ipaddr)
        ipaddr->addr = ip;
    if (netmask)
        netmask->addr = mask;
    if (gw)
        gw->addr = gateway;

    return 0;
}

static int bl606p_subscribe(aos_dev_t *dev, uint32_t event, event_callback_t cb, void *param)
{
    return -1;
}

static int bl606p_ping_remote(aos_dev_t *dev, int type, char *remote_ip)
{
    return -1;
}

static net_ops_t bl606p_net_driver = {
    .set_mac_addr   = bl606p_set_mac_addr,
    .get_mac_addr   = bl606p_get_mac_addr,
    .set_dns_server = bl606p_set_dns_server,
    .get_dns_server = bl606p_get_dns_server,
    .set_hostname   = bl606p_set_hostname,
    .get_hostname   = bl606p_get_hostname,
    .start_dhcp     = bl606p_start_dhcp,
    .stop_dhcp      = bl606p_stop_dhcp,
    .set_ipaddr     = bl606p_set_ipaddr,
    .get_ipaddr     = bl606p_get_ipaddr,
    .subscribe      = bl606p_subscribe,
    .ping           = bl606p_ping_remote,
};

/**
    The wifi mode is controlled by the global variable 'wifi_mode'
*/
static int bl606p_set_mode(aos_dev_t *dev, wifi_mode_t mode)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_get_mode(aos_dev_t *dev, wifi_mode_t *mode)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_init(aos_dev_t *dev)
{
    // wifi_on();
    return 0;
}

static int bl606p_deinit(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    wifi_sta_stop();
    wifi_ap_stop();
    return -1;
}

static void wifi_ap_start(wifi_config_t *config)
{
    uint8_t hidden_ssid = config->ap_config.hide_ssid ? 1 : 0;
    int     channel     = config->ap_config.channel;

    ap_wifi_interface = wifi_mgmr_ap_enable();
    if (strlen(config->password) == 0) {
        /*no password when only one param*/
        wifi_mgmr_ap_start(ap_wifi_interface, config->ssid, hidden_ssid, NULL, 1);
    } else {
        /*hardcode password*/
        if (channel <= 0 || channel > 11) {
            channel = 1;
        }
        wifi_mgmr_ap_start(ap_wifi_interface, config->ssid, hidden_ssid, config->password, channel);
    }
}

static void wifi_ap_stop(void)
{
    if (ap_wifi_interface) {
        wifi_mgmr_ap_stop(NULL);
        ap_wifi_interface = NULL;
    }
}

static void wifi_sta_start_task(void *arg)
{
    sta_task_state        = 1;
    sta_wifi_interface    = wifi_mgmr_sta_enable();
    wifi_config_t *config = (wifi_config_t *)arg;
    wifi_mgmr_sta_autoconnect_enable();

    if (0 != config->ssid[0]) {
        wifi_mgmr_sta_connect(sta_wifi_interface, config->ssid, config->password, NULL, NULL, 0, 0);
    }
    LOGD(TAG, "%s\r\n", __func__);
    event_publish(EVENT_WIFI_LINK_UP, NULL);

    sta_task_state = 2;
}

static void wifi_sta_stop(void)
{
    if (sta_task_state) {
        wifi_mgmr_sta_autoconnect_disable();
        wifi_mgmr_sta_disconnect();
        aos_msleep(1000);
        wifi_mgmr_sta_disable(NULL);
        aos_msleep(1000);
        sta_task_state     = 0;
        sta_wifi_interface = NULL;
    }
}

static int bl606p_start(aos_dev_t *dev, wifi_config_t *config)
{
    DRIVER_INVALID_RETURN_VAL;

    if (config->mode == WIFI_MODE_STA) {
        wifi_sta_stop();
        wifi_ap_stop();
        memcpy(&g_config, config, sizeof(wifi_config_t));
        aos_task_t task_handle;
        aos_task_new_ext(&task_handle, "wifi_sta_start_task", wifi_sta_start_task, &g_config, 1024 * 6, 35);
    } else if (config->mode == WIFI_MODE_AP) {
        LOGD(TAG, "start softap!\n");
        wifi_sta_stop();
        wifi_ap_start(config);
    } else {
        LOGD(TAG, "Not supported wifi mode!\n");
    }

    return 0;
}

static int bl606p_stop(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;
    wifi_sta_stop();
    wifi_ap_stop();
    return 0;
}

static int bl606p_reset(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;
    wifi_sta_stop();
    wifi_ap_stop();
    return 0;
}

/** conf APIs */
static int bl606p_set_lpm(aos_dev_t *dev, wifi_lpm_mode_t mode)
{
    DRIVER_INVALID_RETURN_VAL;

    g_wifi_lpm_mode = mode;

    return 0;
}

static int bl606p_get_lpm(aos_dev_t *dev, wifi_lpm_mode_t *mode)
{
    *mode = g_wifi_lpm_mode;
    return 0;
}

static int bl606p_set_protocol(aos_dev_t *dev, uint8_t protocol_bitmap)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_get_protocol(aos_dev_t *dev, uint8_t *protocol_bitmap)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

static int bl606p_set_country(aos_dev_t *dev, wifi_country_t country)
{
    DRIVER_INVALID_RETURN_VAL;

    return -1;
}

static int bl606p_get_country(aos_dev_t *dev, wifi_country_t *country)
{
    DRIVER_INVALID_RETURN_VAL;

    return 0;
}

/**
    When wifi is disconnected, judge if reconnect wifi
*/
static int bl606p_set_auto_reconnect(aos_dev_t *dev, bool en)
{
    DRIVER_INVALID_RETURN_VAL;

    return -1;
}

static int bl606p_get_auto_reconnect(aos_dev_t *dev, bool *en)
{
    DRIVER_INVALID_RETURN_VAL;

    return -1;
}

static int bl606p_power_on(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

