XUANTIE-RV/open-yoc/components/drv_wifi_bl606p/bl606p_devops.c
    return 0;
}

static int bl606p_power_off(aos_dev_t *dev)
{
    return 0;
}

/**
    TBD, scan with scan config
*/

static int bl606p_start_scan(aos_dev_t *dev, wifi_scan_config_t *config, bool block)
{
    int ret = -1;
    LOGD(TAG, "%s\r\n", __func__);
    if (block == 0) {
        return -1;
    }

    if (!g_evt_func->scan_compeleted) {
        return -1;
    }
    ap_ary_p = NULL;
    scan_cnt = 0;

    wifi_mgmr_all_ap_scan(&ap_ary_p, &scan_cnt);
    if (scan_cnt != 0) {
        wifi_ap_record_t *ap_records = aos_calloc(sizeof(wifi_ap_record_t), scan_cnt);

        for (int i = 0; i < scan_cnt; i++) {
            memcpy(ap_records[i].ssid, ap_ary_p[i].ssid, ap_ary_p[i].ssid_len);
            memcpy(ap_records[i].bssid, ap_ary_p[i].bssid, 6);
            ap_records[i].channel  = ap_ary_p[i].channel;
            ap_records[i].rssi     = ap_ary_p[i].rssi;
            ap_records[i].authmode = ap_ary_p[i].auth < WIFI_AUTH_MAX ? ap_ary_p[i].auth : WIFI_AUTH_MAX;
        }

        g_evt_func->scan_compeleted(wifi_evt_dev, scan_cnt, ap_records);
        aos_free(ap_records);
        aos_free(ap_ary_p);
        ret = 0;
    }
    return ret;
}

static int bl606p_sta_get_link_status(aos_dev_t *dev, wifi_ap_record_t *ap_info)
{
    DRIVER_INVALID_RETURN_VAL;

    wifi_mgmr_sta_connect_ind_stat_info_t info = { 0 };

    int state;
    int rssi, channel;

    LOGD(TAG, "%s\r\n", __func__);
    wifi_mgmr_state_get(&state);
    if ((WIFI_STATE_CONNECTED_IP_GOT != state) && (WIFI_STATE_CONNECTED_IP_GETTING != state)) {
        ap_info->link_status = WIFI_STATUS_LINK_DOWN;
    } else {
        ap_info->link_status = WIFI_STATUS_LINK_UP;
        wifi_mgmr_sta_connect_ind_stat_get(&info);
        wifi_mgmr_rssi_get(&rssi);
        memcpy(ap_info->ssid, info.ssid, sizeof(ap_info->ssid));
        memcpy(ap_info->bssid, info.bssid, sizeof(ap_info->bssid));
        wifi_mgmr_channel_get(&channel);
        ap_info->channel = (uint8_t)channel;
        ap_info->rssi    = rssi;
    }

    return 0;
}

static int bl606p_ap_get_sta_list(aos_dev_t *dev, wifi_sta_list_t *sta)
{
    DRIVER_INVALID_RETURN_VAL;

    int        state   = WIFI_STATE_UNKNOWN;
    int        cnt     = 0;
    uint8_t    sta_cnt = 0, i, j;
    uint8_t    index   = 0;
    long long sta_time;

    struct wifi_sta_basic_info sta_info;

    wifi_mgmr_state_get(&state);
    if (!WIFI_STATE_AP_IS_ENABLED(state)) {
        LOGD(TAG, "wifi AP is not enabled, state = %d\r\n", state);
        return -1;
    }

    wifi_mgmr_ap_sta_cnt_get(&sta_cnt);
    if (!sta_cnt) {
        LOGD(TAG, "no sta connect current AP, sta_cnt = %d\r\n", sta_cnt);
        return -1;
    }

    memset(&sta_info, 0, sizeof(struct wifi_sta_basic_info));
    //LOGD(TAG, "sta list:\r\n");
    //LOGD(TAG, "-----------------------------------------------------------------------------------\r\n");
    //LOGD(TAG, "No.      StaIndex      Mac-Address       Signal      DateRate            TimeStamp\r\n");
    //LOGD(TAG, "-----------------------------------------------------------------------------------\r\n");
    for (i = 0; i < sta_cnt; i++) {
        wifi_mgmr_ap_sta_info_get(&sta_info, i);
        if (!sta_info.is_used || (sta_info.sta_idx == 0xef)) {
            continue;
        }

        cnt++;
        sta_time = (long long)sta_info.tsfhi;
        sta_time = (sta_time << 32) | sta_info.tsflo;

        for (j = 0; j < sizeof(data_rate_list) / sizeof(data_rate_list[0]); j++) {
            if (data_rate_list[j].data_rate == sta_info.data_rate) {
                index = j;
                break;
            }
        }

        if (i >= HAL_WIFI_MAX_CONN_NUM) {
            LOGD(TAG, "WiFi connection exceeds max number of HAL\n");
            break;
        }

        LOGD(TAG,
             " %u       "
             "   %u        "
             "%02X:%02X:%02X:%02X:%02X:%02X    "
             "%d      "
             "%s      "
             "0x%llx"
             "\r\n",
             i,
             sta_info.sta_idx,
             sta_info.sta_mac[0],
             sta_info.sta_mac[1],
             sta_info.sta_mac[2],
             sta_info.sta_mac[3],
             sta_info.sta_mac[4],
             sta_info.sta_mac[5],
             sta_info.rssi,
             data_rate_list[index].val,
             sta_time);
        memcpy(sta->sta[i].mac, sta_info.sta_mac, 6);
    }
    sta->num = cnt;
    return 0;
}

static int bl606p_start_mgnt_monitor(aos_dev_t *dev, wifi_mgnt_cb_t cb)
{
    DRIVER_INVALID_RETURN_VAL;

    mgmt_is_enable = 1;
    mgmt_fn        = cb;

    return 0;
}

static int bl606p_stop_mgnt_monitor(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    mgmt_is_enable = 0;
    mgmt_fn        = NULL;

    return 0;
}

static int bl606p_start_monitor(aos_dev_t *dev, wifi_promiscuous_cb_t cb)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    sinnfer_fn = cb;
    wifi_mgmr_sniffer_enable();

    return 0;
}

static int bl606p_stop_monitor(aos_dev_t *dev)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    wifi_mgmr_sniffer_disable();
    wifi_mgmr_sniffer_unregister(NULL);
    sinnfer_fn = NULL;

    return 0;
}

static int bl606p_set_channel(aos_dev_t *dev, uint8_t primary, wifi_second_chan_t second)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    return wifi_mgmr_channel_set(primary, 0);
}

static int bl606p_get_channel(aos_dev_t *dev, uint8_t *primary, wifi_second_chan_t *second)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    int channel;
    if (wifi_mgmr_channel_get(&channel) == 0) {
        *primary = channel;
        return 0;
    } else {
        return -1;
    }
}

static int bl606p_send_80211_raw_frame(aos_dev_t *dev, void *buffer, uint16_t len)
{
    DRIVER_INVALID_RETURN_VAL;

    LOGD(TAG, "%s\r\n", __func__);
    int ret = wifi_mgmr_raw_80211_send((uint8_t *)buffer, len);
    return ret;
}

static int bl606p_install_event_cb(aos_dev_t *dev, wifi_event_func *evt_func)
{
    DRIVER_INVALID_RETURN_VAL;

    g_evt_func   = evt_func;
    wifi_evt_dev = dev;

