XUANTIE-RV/open-yoc/components/drv_wifi_bl606p/bl606p_devops.c
    return 0;
}

static wifi_driver_t bl606p_wifi_driver = {
    /** basic APIs */

    .init             = bl606p_init,
    .deinit           = bl606p_deinit,
    .reset            = bl606p_reset,
    .set_mode         = bl606p_set_mode,
    .get_mode         = bl606p_get_mode,
    .install_event_cb = bl606p_install_event_cb,

    .set_protocol        = bl606p_set_protocol,
    .get_protocol        = bl606p_get_protocol,
    .set_country         = bl606p_set_country,
    .get_country         = bl606p_get_country,
    .set_mac_addr        = bl606p_set_mac_addr,
    .get_mac_addr        = bl606p_get_mac_addr,
    .set_auto_reconnect  = bl606p_set_auto_reconnect,
    .get_auto_reconnect  = bl606p_get_auto_reconnect,
    .set_lpm             = bl606p_set_lpm,
    .get_lpm             = bl606p_get_lpm,
    .power_on            = bl606p_power_on,
    .power_off           = bl606p_power_off,
    .start_scan          = bl606p_start_scan,
    .start               = bl606p_start,
    .stop                = bl606p_stop,
    .sta_get_link_status = bl606p_sta_get_link_status,
    .ap_get_sta_list     = bl606p_ap_get_sta_list,

    /** promiscuous APIs */
    .start_monitor = bl606p_start_monitor,
    .stop_monitor  = bl606p_stop_monitor,

    .start_mgnt_monitor   = bl606p_start_mgnt_monitor,
    .stop_mgnt_monitor    = bl606p_stop_mgnt_monitor,
    .send_80211_raw_frame = bl606p_send_80211_raw_frame,
    .set_channel          = bl606p_set_channel,
    .get_channel          = bl606p_get_channel,

    .set_smartcfg = NULL,
};

static aos_dev_t *bl606p_dev_init(driver_t *drv, void *config, int id)
{
    aos_dev_t *dev = device_new(drv, sizeof(wifi_dev_t), id);

    return dev;
}

static void bl606p_dev_uninit(aos_dev_t *dev)
{
    aos_check_param(dev);

    device_free(dev);
}

static int bl606p_dev_open(aos_dev_t *dev)
{
    return 0;
}

static int bl606p_dev_close(aos_dev_t *dev)
{
    return 0;
}

static netdev_driver_t bl606p_driver = {
    .drv =
        {
            .name   = "wifi",
            .init   = bl606p_dev_init,
            .uninit = bl606p_dev_uninit,
            .open   = bl606p_dev_open,
            .close  = bl606p_dev_close,
        },
    .link_type = NETDEV_TYPE_WIFI,
    .net_ops   = &bl606p_net_driver,
    .link_ops  = &bl606p_wifi_driver,
};

#define WIFI_MAC_ADDR_KEY "wifi_key_mac"

static int wifi_get_debug_mac_address(uint8_t mac[6])
{
    mac[0] = 0x18;
    mac[1] = 0xb9;
    mac[2] = 0x05;
    mac[3] = 0xde;
    mac[4] = 0x4a;
    mac[5] = 0xee;

#ifdef CONFIG_KV_SMART
    char mac_str[32];

    if (aos_kv_getstring(WIFI_MAC_ADDR_KEY, mac_str, sizeof(mac_str)) > 0) {
        sscanf(mac_str, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
    }
#endif

    return 0;
}

static void _sniffer_callback(void *env, uint8_t *pkt, int len)
{
    if (len < sizeof(ieee80211_frame_info_t)) {
        // while(1);
        return;
    }
    ieee80211_frame_info_t     *info = (ieee80211_frame_info_t *)pkt;
    wifi_promiscuous_pkt_t     *buf  = aos_malloc(sizeof(wifi_promiscuous_pkt_t) + len);
    wifi_promiscuous_pkt_type_t type = WIFI_PKT_MISC;

    // buf->rx_ctrl.rssi    = info->rssi;
    buf->rx_ctrl.sig_len = len - sizeof(ieee80211_frame_info_t);
    memcpy(buf->payload, pkt + sizeof(ieee80211_frame_info_t), len - sizeof(ieee80211_frame_info_t));

    if ((info->i_fc & 0xc) == IEEE80211_FTYPE_DATA) {
        type = WIFI_PKT_DATA;
    } else if ((info->i_fc & 0xc) == IEEE80211_FTYPE_MGMT) {
        type = WIFI_PKT_MGMT;
    } else if ((info->i_fc & 0xc) == IEEE80211_FTYPE_CTL) {
        type = WIFI_PKT_CTRL;
    }

    if (mgmt_is_enable && mgmt_fn) {
        if (type == WIFI_PKT_MGMT) {
            mgmt_fn(pkt, len);
        }
    }
    if (sinnfer_fn) {
        sinnfer_fn(buf, type);
    }
    aos_free(buf);
}

static void event_cb_wifi_event(input_event_t *event, void *private_data)
{
    static wifi_conf_t conf = {
        .country_code = "CN",
    };

    switch (event->code) {
        case CODE_WIFI_ON_INIT_DONE: {
            LOGD(TAG, "[APP] [EVT] INIT DONE %ld\r\n", aos_now_ms());
            wifi_mgmr_start_background(&conf);
        } break;
        case CODE_WIFI_ON_MGMR_DONE: {
            LOGD(TAG, "[APP] [EVT] MGMR DONE %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_MGMR_DENOISE: {
            LOGD(TAG, "[APP] [EVT] Microwave Denoise is ON %lld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_SCAN_DONE: {
            LOGD(TAG, "[APP] [EVT] SCAN Done %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_SCAN_DONE_ONJOIN: {
            LOGD(TAG, "[APP] [EVT] SCAN On Join %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_DISCONNECT: {
            LOGD(TAG,
                 "[APP] [EVT] disconnect %ld, Reason: %s\r\n",
                 (long)aos_now_ms(),
                 wifi_mgmr_status_code_str(event->value));
        } break;
        case CODE_WIFI_ON_CONNECTING: {
            LOGD(TAG, "[APP] [EVT] Connecting %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_CMD_RECONNECT: {
            LOGD(TAG, "[APP] [EVT] Reconnect %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_CONNECTED: {
            LOGD(TAG, "[APP] [EVT] connected %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_PRE_GOT_IP: {
            LOGD(TAG, "[APP] [EVT] connected %ld\r\n", aos_now_ms());
        } break;
        case CODE_WIFI_ON_GOT_IP: {
            LOGD(TAG, "[APP] [EVT] GOT IP %ld\r\n", aos_now_ms());
            event_publish(EVENT_NET_GOT_IP, NULL);
            extern bool hal_bt_is_connected(void);
            if (hal_bt_is_connected()) {
                tg_wifi_ps_mode_entry();
            }

        } break;
        case CODE_WIFI_ON_EMERGENCY_MAC: {
            LOGD(TAG, "[APP] [EVT] EMERGENCY MAC %ld\r\n", aos_now_ms());
        } break;
            break;
        case CODE_WIFI_ON_AP_STA_ADD: {
            LOGD(TAG, "[APP] [EVT] [AP] [ADD] %ld, sta idx is %lu\r\n", aos_now_ms(), (uint32_t)event->value);
        } break;
        case CODE_WIFI_ON_AP_STA_DEL: {
            LOGD(TAG, "[APP] [EVT] [AP] [DEL] %ld, sta idx is %lu\r\n", aos_now_ms(), (uint32_t)event->value);
        } break;
        default: {
            LOGD(TAG, "[APP] [EVT] Unknown code %u, %ld\r\n", event->code, aos_now_ms());
            /*nothing*/
        }
    }
}

static int _wifi_start_firmware_task(void)
{
    bl_pm_init();
    krhino_task_create(&wifi_fw_task,
                       "fw",
                       NULL,
                       TASK_PRIORITY_FW,
                       0,
                       (cpu_stack_t *)((uint32_t)wifi_stack | 0x40000000),
                       WIFI_STACK_SIZE,
                       wifi_main,
                       1);
    return 0;
}

/**
 * @brief  register wifi driver of rtl8723
 * @param  [in] config
 * @return
 */
void wifi_bl606p_register(void *config)
{
    int ret = 0;

    uint8_t mac_addr[6] = { 0 };

    tcpip_init(NULL, NULL);

    /* get mac from efuse */
    ret = bl_efuse_get_mac(mac_addr);

    if (ret < 0) {
        wifi_get_debug_mac_address(mac_addr);
    }

    /* set mac addr to wifi mgr sys */
    wifi_mgmr_sta_mac_set(mac_addr);

    _wifi_start_firmware_task();

    aos_register_event_filter(EV_WIFI, event_cb_wifi_event, NULL);

    /*Trigger to start Wi-Fi*/
    aos_post_event(EV_WIFI, CODE_WIFI_ON_INIT_DONE, 0);

    wifi_mgmr_sniffer_register(NULL, _sniffer_callback);

    driver_register(&bl606p_driver.drv, NULL, 0);
}
